[
   {
      "title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest",
      "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "
   },
   {
      "title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover",
      "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "
   },
   {
      "title": "MOXIE Could Help Future Rockets Launch Off Mars",
      "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."
   },
   {
      "title": "Three New Views of Mars' Moon Phobos",
      "preview": "Taken with the infrared camera aboard NASA's Odyssey orbiter, they reveal temperature variations on the small moon as it drifts into and out of Mars’ shadow."
   },
   {
      "title": "Mars Is Getting a New Robotic Meteorologist",
      "preview": "Sensors on NASA's Perseverance will help prepare for future human exploration by taking weather measurements and studying dust particles."
   },
   {
      "title": "Meet the People Behind NASA's Perseverance Rover",
      "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "
   },
   {
      "title": "The Launch Is Approaching for NASA's Next Mars Rover, Perseverance",
      "preview": "The Red Planet's surface has been visited by eight NASA spacecraft. The ninth will be the first that includes a roundtrip ticket in its flight plan. "
   },
   {
      "title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight",
      "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."
   },
   {
      "title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary",
      "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."
   },
   {
      "title": "NASA Readies Perseverance Mars Rover's Earthly Twin ",
      "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."
   },
   {
      "title": "NASA's MAVEN Maps Winds in the Martian Upper Atmosphere that Mirror the Terrain Below and Gives Clues to Martian Climate",
      "preview": "Researchers have created the first map of wind circulation in the upper atmosphere of a planet besides Earth, using data from NASA’s MAVEN spacecraft that were collected during the last two years."
   },
   {
      "title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes",
      "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. "
   },
   {
      "title": "NASA Establishes Board to Initially Review Mars Sample Return Plans",
      "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."
   },
   {
      "title": "NASA's Curiosity Mars Rover Takes a New Selfie Before Record Climb",
      "preview": "Along with capturing an image before its steepest ascent ever, the robotic explorer filmed its \"selfie stick,\" or robotic arm, in action."
   },
   {
      "title": "NASA's Mars 2020 Comes Full Circle",
      "preview": "Aiming to pinpoint the Martian vehicle's center of gravity, engineers took NASA's 2,300-pound Mars 2020 rover for a spin in the clean room at JPL. "
   }
]